internal/cli/testdata/golden/kitchen-sink-ts/topology.mmd
%% Architecture of kitchen-sink-ts, generated by cloudcc.
flowchart LR
    config_log_level{{"log_level\nconfig"}}
    config_stripe_key{{"stripe_key\nconfig"}}
    execution_unit_api["api\nexecution_unit"]
    execution_unit_auditor["auditor\nexecution_unit"]
    execution_unit_reporter["reporter\nexecution_unit"]
    expose_reporter_web(["reporter-web\nexpose"])
    expose_shop_api(["shop-api\nexpose"])
    persist_fs_itemDocs[("itemDocs\npersist_fs")]
    persist_kv_catalogue[("catalogue\npersist_kv")]
    persist_orm_shopdb[("shopdb\npersist_orm")]
    persist_redis_itemCache[("itemCache\npersist_redis")]
    persist_secret_signingKey[("signingKey\npersist_secret")]
    pubsub_itemEvents>"itemEvents\npubsub"]
    expose_reporter_web -->|exposes| execution_unit_reporter
    expose_shop_api -->|exposes| execution_unit_api
    execution_unit_api -->|publishes| pubsub_itemEvents
    execution_unit_auditor -.->|subscribes| pubsub_itemEvents
    execution_unit_api -->|uses| config_log_level
    execution_unit_api -->|uses| config_stripe_key
    execution_unit_api -->|uses| persist_fs_itemDocs
    execution_unit_api -->|uses| persist_kv_catalogue
    execution_unit_api -->|uses| persist_orm_shopdb
    execution_unit_api -->|uses| persist_redis_itemCache
    execution_unit_api -->|uses| persist_secret_signingKey
    execution_unit_api -->|uses| pubsub_itemEvents
    execution_unit_auditor -->|uses| persist_fs_itemDocs
    execution_unit_auditor -->|uses| persist_kv_catalogue
    execution_unit_auditor -->|uses| persist_orm_shopdb
    execution_unit_auditor -->|uses| persist_redis_itemCache
    execution_unit_auditor -->|uses| persist_secret_signingKey
    execution_unit_auditor -->|uses| pubsub_itemEvents
    execution_unit_reporter -->|uses| persist_fs_itemDocs
    execution_unit_reporter -->|uses| persist_kv_catalogue
    execution_unit_reporter -->|uses| persist_orm_shopdb
    execution_unit_reporter -->|uses| persist_redis_itemCache
    execution_unit_reporter -->|uses| persist_secret_signingKey
    execution_unit_reporter -->|uses| pubsub_itemEvents
